[
  {
    "score": "8",
    "album_id": "1TKCBDHIWLiqjWTxomqniD",
    "artist_id": "2ye2Wgw4gimLv2eAKyk1NB",
    "user_id": 1,
    "review": "So it is basically common knowledge that a band will eventually lose sight of their roots and explore. It happens to every band but the important thing isn't why or how they lost sight of what made them great in the first place. It's when they realize it and what they'll do to get back on track. Now for a lot of people it can be seen in Metallica's works as they progressively got less thrashy over the years. And for a lot of people this album is a major comeback for the band and I will say I think it is so too. It's not the best comeback but it's a comebsck nonetheless filled with tracks that can't help but remind you at the very least of the days with RtL or AJFA or Master of Puppets, etc. etc. But overall the album in itself is pretty good tbh even if it wasnt a comeback I honestly think it does well to hold on its own. Its a great mix between shouting and melodic singing and overall a great work from the band"
  },
  {
    "score": "10",
    "album_id": "4Cn4T0onWhfJZwWVzU5a2t",
    "artist_id": "2ye2Wgw4gimLv2eAKyk1NB",
    "user_id": 3,
    "review": "The last good Metallica album. After this they turned into a whiny pop band. This is their last album playing thrash. And it's good. Every song here is badass, but I particularly like 'Harvester of Sorrow' and 'Dyers Eve'. Some of the best thrash there ever was. And when I listen to this I can only weep at how far they have fallen."
  },
  {
    "score": "9",
    "album_id": "24E6rDvGDuYFjlGewp4ntF",
    "artist_id": "2d0hyoQ5ynDBnkvAbJKORj",
    "user_id": 2
  },
  {
    "score": "10",
    "album_id": "4LaRYkT4oy47wEuQgkLBul",
    "artist_id": "2d0hyoQ5ynDBnkvAbJKORj",
    "user_id": 5,
    "review": "Amazing rap metal release, by far the best i have heard. Lyrically it contains heavily political themes, but either the lyrics are too deep for me to understand them or they are badly writen, either way i dont care much for them. Instrumentally though, this album is a completly different story. The rapping is pretty aggressive yet enjoyable to listen to (some parts are straight funky stuff), and even though there is some screming at times it fits well with the sort of strong emotions the songs deal about. The guitars are incredible, both in terms of enjoyability and innovation, even more amazing considering this level of experimentation was done in the early 90's and that this release actualy was quite commercial. Very good riffing and solos, with a nice variety. The bass and drumming are great on their own as well and they provide enough glue to stick all of it together neatly, both of them are really creative in their playing and the mix does a nice job in showing what they are doing as well. In terms of sound it has has been described as hardcore punk combined with hip hop rather than metal and i do tend to agree with this. The most amazing stuff about the release is that even though the songs are all similar (except perhaps settle for nothing, which is by far the worst song and only one which i dont fully enjoy) they still are able to stand out great on their own and at least to me the album entertains me greatly from start to finish. Overal it is an amazing album both in terms of innovation and creativity, and despite its minor flaws i could not give it less than a perfect score."
  },
  {
    "score": "5",
    "album_id": "4LaRYkT4oy47wEuQgkLBul",
    "artist_id": "2d0hyoQ5ynDBnkvAbJKORj",
    "user_id": 1
  },
  {
    "score": "7",
    "album_id": "4LaRYkT4oy47wEuQgkLBul",
    "artist_id": "2d0hyoQ5ynDBnkvAbJKORj",
    "user_id": 4,
    "review": "When I first gingerly slid it into my walkman and wandered the halls of corporate offices (which I cleaned) - watching the tie-wearing goons go about their pointless lives it felt very groovy to have a revolution plugged into your ears. That's where the resonance of this album lies with me. Although it's impact has faded as the years have gone by, and the band themselves are now figureheads of a moronic consumerist pseudolution - it's metallic hooks and spitting anger have aged well."
  },
  {
    "score": "7",
    "album_id": "7fJJK56U9fHixgO0HQkhtI",
    "artist_id": "6M2wZ9GZgrQXHCFfjv46we",
    "user_id": 1
  }
]
  